backend/app/Controllers/Api/Auth.php

    public function requestOtp()
    {
        $payload  = $this->request->getJSON(true) ?? $this->request->getPost();
        $mobile   = trim((string) ($payload['mobile'] ?? ''));
        $password = trim((string) ($payload['password'] ?? ''));

        if ($mobile === '' || $password === '') {
            return $this->failValidationErrors([
                'mobile'   => 'Mobile number is required.',
                'password' => 'Password is required.',
            ]);
        }

        $response = $this->callApi([
            'funName' => 'requestOTP',
            'app_id'  => $this->appId,
            'mobile'  => $mobile,
        ]);

        if (! isset($response->response)) {
            return $this->fail('Unable to reach OTP server.');
        }

        $userModel = model(UserModel::class);
        $user      = $userModel->where('mobile', $mobile)->first();
---
SELECT *
FROM `user`
WHERE `mobile` = '0761355599'
 LIMIT 1

    public function me()
    {
        $session = session();
        if (! $session->get('isLoggedIn')) {
            return $this->respond([
                'status' => 'guest',
                'user'   => null,
            ]);
        }

        $userId = $session->get('user_id');
        if (! $userId) {
            $session->destroy();
            return $this->respond([
                'status' => 'guest',
                'user'   => null,
            ]);
        }

        $userModel = model(UserModel::class);
        $user      = $userModel->find($userId);
---
SELECT *
FROM `user`
WHERE `user`.`id` = 'a134850f7df1e4c74a6444750dd0a78b'