backend/app/Controllers/Api/Characters.php

SELECT `id`, `name`, `slug`, `avatar`, `title`, `personality`, `expertise`, `tone`, `tags`, `video_url`, `created_at`, `is_active`
FROM `ai_characters`
WHERE `is_active` = 1
ORDER BY `created_at` DESC
---
    public function index()
    {
        $db = Database::connect();

        $includeUserCharacters = $this->request->getGet('include_user');
        $includeUser = false;

        if (is_string($includeUserCharacters)) {
            $includeUser = filter_var($includeUserCharacters, FILTER_VALIDATE_BOOLEAN);
        } elseif (is_bool($includeUserCharacters)) {
            $includeUser = $includeUserCharacters;
        }

        $userId = $includeUser ? ($this->request->getGet('user_id') ?? session('user_id')) : null;
        $hasUserTable = $db->tableExists('user_characters');

        $globalRows = $db->table('ai_characters')
            ->select('id, name, slug, avatar, title, personality, expertise, tone, tags, video_url, intro_line, created_at, is_active, age, role')
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();