backend/app/Controllers/Api/Chats.php

SELECT *
FROM `ai_characters`
WHERE `slug` = 'kai'
SELECT `id`, `sender`, `message`, `created_at`
FROM `ai_messages`
WHERE `character_slug` = 'kai'
AND `user_id` = 'a134850f7df1e4c74a6444750dd0a78b'
ORDER BY `created_at` ASC
 LIMIT 200
---
    public function show(string $slug)
    {
        $userId = $this->request->getGet('user_id') ?? session('user_id');

        if (! $userId) {
            return $this->fail('user_id is required.', 400);
        }

        $db = Database::connect();

        $character = $db->table('ai_characters')
            ->where('slug', $slug)
            ->get()
            ->getRowArray();

        if (! $character) {
            return $this->failNotFound('Character not found.');
        }

        $messages = $db->table('ai_messages')
            ->select('id, sender, message, created_at')
            ->where('character_slug', $slug)
            ->where('user_id', $userId)
            ->orderBy('created_at', 'ASC')
            ->limit(200)
            ->get()
            ->getResultArray();

SELECT *
FROM `ai_characters`
WHERE `slug` = 'rina'
---
    public function send(string $slug)
    {
        $db = Database::connect();
        $character = $db->table('ai_characters')
            ->where('slug', $slug)
            ->get()
            ->getRowArray();

SELECT *
FROM `ai_messages`
WHERE `character_slug` = 'rina'
AND `user_id` = 'a134850f7df1e4c74a6444750dd0a78b'
ORDER BY `id` DESC
 LIMIT 10
---

        $sessionId = session_id();

        $history = $db->table('ai_messages')
            ->where('character_slug', $slug)
            ->where('user_id', $userId)
            ->orderBy('id', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();

INSERT INTO `ai_messages` (`character_slug`, `user_id`, `sender`, `message`, `session_id`) VALUES ('rina', 'a134850f7df1e4c74a6444750dd0a78b', 'user', 'hi', '80e57df9428e25d30685364f5ac30def')
---
            'session_id'     => $sessionId,
        ]);

        $db->table('ai_messages')->insert([
            'character_slug' => $slug,
            'user_id'        => $userId,
            'sender'         => 'ai',
            'message'        => $reply,
            'session_id'     => $sessionId,
        ]);